-- 유저
INSERT INTO users(username, password, name, student_number, img_url, created_at, role, age, grade, email, university, department, is_enable, update_at)
VALUES ('test','$2a$10$dM/GwObkJcqYlGPAVMGEiuUYXq.aAh1XBeYr4QXOpuPBr1PiH4Sdm', '홍길동', 2018123123, '/user_profile_img/img1.png' ,'2023-03-03 22:11:52.583876', 'ROLE_USER', 25, 4, '홍길동@naver.com', '소프트웨어융합대학', '컴퓨터학부', true, '2023-03-03 22:11:52.583876'),
       ('test1','$2a$10$dM/GwObkJcqYlGPAVMGEiuUYXq.aAh1XBeYr4QXOpuPBr1PiH4Sdm', '광개토대왕', 2019781483, '/user_profile_img/img2.png' ,'2023-03-03 22:11:52.583876', 'ROLE_USER', 23, 2, '광개토대왕@naver.com', '공학대학', '전자공학부', true, '2023-03-03 22:11:52.583876'),
       ('test2','$2a$10$dM/GwObkJcqYlGPAVMGEiuUYXq.aAh1XBeYr4QXOpuPBr1PiH4Sdm', '이순신', 2020137238, '/user_profile_img/img3.png' ,'2023-03-03 22:11:52.583876', 'ROLE_USER', 24, 3, '이순신@naver.com', '약학대학', '약학과', true, '2023-03-03 22:11:52.583876'),
       ('test3','$2a$10$dM/GwObkJcqYlGPAVMGEiuUYXq.aAh1XBeYr4QXOpuPBr1PiH4Sdm', '강감찬', 2022394193, '/user_profile_img/img4.png' ,'2023-03-03 22:11:52.583876', 'ROLE_USER', 21, 2, '강감찬@naver.com', '과학기술융합대학', '화학분자공학과', true, '2023-03-03 22:11:52.583876'),
       ('test4','$2a$10$dM/GwObkJcqYlGPAVMGEiuUYXq.aAh1XBeYr4QXOpuPBr1PiH4Sdm', '연개소문', 2021981473, '/user_profile_img/img5.png' ,'2023-03-03 22:11:52.583876', 'ROLE_USER', 22, 3, '연개소문@naver.com', '국제문화대학', '한국언어문학과', true, '2023-03-03 22:11:52.583876'),
       ('test5','$2a$10$dM/GwObkJcqYlGPAVMGEiuUYXq.aAh1XBeYr4QXOpuPBr1PiH4Sdm', '세종대왕', 2020284493, '/user_profile_img/img6.png' ,'2023-03-03 22:11:52.583876', 'ROLE_USER', 23, 4, '세종대왕@naver.com', '언론정보대학', '광고홍보학과', true, '2023-03-03 22:11:52.583876'),
       ('test6','$2a$10$dM/GwObkJcqYlGPAVMGEiuUYXq.aAh1XBeYr4QXOpuPBr1PiH4Sdm', '안중근', 2017451830, '/user_profile_img/img7.png' ,'2023-03-03 22:11:52.583876', 'ROLE_USER', 26, 4, '안중근@naver.com', '디자인대학', '커뮤니케이션디자인학과', true, '2023-03-03 22:11:52.583876'),
       ('test7','$2a$10$dM/GwObkJcqYlGPAVMGEiuUYXq.aAh1XBeYr4QXOpuPBr1PiH4Sdm', '김구', 2022803299, '/user_profile_img/img8.png' ,'2023-03-03 22:11:52.583876', 'ROLE_USER', 22, 2, '김구@naver.com', '예체능대학', '무용학과', true, '2023-03-03 22:11:52.583876');


-- 팀플실 : 소프트웨어융합대학
INSERT INTO study_room(name, university, building, location, capacity)
VALUES ('큐브 0', '소프트웨어융합대학', '학연산클러스터지원센터', '5층', 4),
       ('큐브 1', '소프트웨어융합대학', '학연산클러스터지원센터', '5층', 4),
       ('큐브 2', '소프트웨어융합대학', '학연산클러스터지원센터', '5층', 4),
       ('큐브 3', '소프트웨어융합대학', '학연산클러스터지원센터', '5층', 4),
       ('SMaSH 0', '소프트웨어융합대학', '4공학관', '1층 SMaSH', 6),
       ('SMaSH 1', '소프트웨어융합대학', '4공학관', '1층 SMaSH', 6),
       ('SMaSH 2', '소프트웨어융합대학', '4공학관', '1층 SMaSH', 6),
       ('SMaSH 3', '소프트웨어융합대학', '4공학관', '1층 SMaSH', 6),
       ('Alan Turing', '소프트웨어융합대학', '4공학관', '1층 SMaSH', 6),
       ('Steve Jobs', '소프트웨어융합대학', '4공학관', '1층 SMaSH', 6); -- 더 추가할 예정

-- 팀플실 : 공학대학
INSERT INTO study_room(name, university, building, location, capacity)
VALUES ('105호', '공학대학', '1공학관', '1층', 60),
       ('202호', '공학대학', '1공학관', '2층', 80),
       ('301호', '공학대학', '1공학관', '3층', 60), -- (스마트녹화)
       ('401호', '공학대학', '1공학관', '4층', 80),
       ('506호', '공학대학', '1공학관', '5층', 80),
       ('114호', '공학대학', '2공학관', '2층', 25), -- (건설환경공학과대학원세미나실/타과대여불가)
       ('205호', '공학대학', '2공학관', '2층', 60), -- (멀티미디어실)
       ('223호', '공학대학', '2공학관', '2층', 160), -- (계단강의실)
       ('419호', '공학대학', '2공학관', '4층', 60), -- (멀티미디어실/건설환경공학과/강의배정제한)
       ('428호', '공학대학', '2공학관', '4층', 80), -- (스마트녹화)
       ('219호', '공학대학', '3공학관', '2층', 80); -- (스마트녹화)

-- 팀플실 : 약학대학
INSERT INTO study_room(name, university, building, location, capacity)
VALUES ('PBL(근면)', '약학대학', '약학관', '1층', 40),
       ('PBL(정직)', '약학대학', '약학관', '1층', 40),
       ('PBL(겸손)', '약학대학', '약학관', '1층', 40),
       ('PBL(봉사)', '약학대학', '약학관', '1층', 40);

-- 팀플실 : 과학기술융합대학
INSERT INTO study_room(name, university, building, location, capacity)
VALUES ('208호 IC-PBL 세미나실1', '과학기술융합대학', '1과학기술관', '2층', 40),
       ('214호 IC-PBL 캡스톤 디자인실', '과학기술융합대학', '1과학기술관', '2층', 40),
       ('308호 IC-PBL 세미나실2', '과학기술융합대학', '1과학기술관', '3층', 40),
       ('309호 멀티미디어실', '과학기술융합대학', '1과학기술관', '3층', 40),
       ('310호 IC-PBL 세미나실3', '과학기술융합대학', '1과학기술관', '3층', 40),
       ('407호 IC-PBL 세미나실4', '과학기술융합대학', '1과학기술관', '4층', 40),
       ('417호 IC-PBL 강의실', '과학기술융합대학', '1과학기술관', '4층', 40),
       ('105호 IC-PBL ScienceUp Studio', '과학기술융합대학', '2과학기술관', '1층', 40),
       ('206호 강의실', '과학기술융합대학', '2과학기술관', '2층', 40),
       ('210호 IC-PBL 강의실', '과학기술융합대학', '2과학기술관', '2층', 40),
       ('304호 강의실', '과학기술융합대학', '2과학기술관', '3층', 80),
       ('305호 강의실', '과학기술융합대학', '2과학기술관', '3층', 80),
       ('412호 강의실', '과학기술융합대학', '2과학기술관', '4층', 80),
       ('413호 강의실', '과학기술융합대학', '2과학기술관', '4층', 80),
       ('511호 계단강의실', '과학기술융합대학', '2과학기술관', '5층', 160); -- (계단강의실)

-- 팀플실 : 국제문학대학
INSERT INTO study_room(name, university, building, location, capacity)
VALUES ('IC-PBL 꿈의 둥지(OPEN SPACE)', '국제문학대학', '국제문화관', '1층', 80),
       ('122호 IC-PBL 강의실', '국제문학대학', '국제문화관', '1층', 60),
       ('201호 강의실', '국제문학대학', '국제문화관', '2층', 60),
       ('202호 강의실', '국제문학대학', '국제문화관', '2층', 60),
       ('304호 강의실', '국제문학대학', '국제문화관', '3층', 60),
       ('305호 강의실', '국제문학대학', '국제문화관', '3층', 60);

-- 팀플실 : 언론정보대학
INSERT INTO study_room(name, university, building, location, capacity)
VALUES ('114호 교양강의실 1', '국제문학대학', '언론정보관', '지하1층', 40),
       ('115호 교양강의실 2', '국제문학대학', '언론정보관', '지하1층', 40),
       ('수업행동분석강의실', '국제문학대학', '언론정보관', '1층', 40), -- (대형스크린)
       ('ALC 1', '국제문학대학', '언론정보관', '1층', 40),
       ('ALC 2', '국제문학대학', '언론정보관', '1층', 40),
       ('스마트교육강의실', '국제문학대학', '언론정보관', '1층', 40),
       ('202호 IC-PBL 강의실', '국제문학대학', '언론정보관', '2층', 40),
       ('209호 IC-PBL 세미나실', '국제문학대학', '언론정보관', '2층', 40),
       ('오디오스튜디오', '국제문학대학', '언론정보관', '2층', 20), -- (오디오스튜디오)
       ('비디오스튜디오', '국제문학대학', '언론정보관', '2층', 20), -- (비디오스튜디오)
       ('IC-PBL Lab.1 ', '국제문학대학', '언론정보관', '3층', 5), -- (큐브처럼 되어있음.)
       ('IC-PBL Lab.2 ', '국제문학대학', '언론정보관', '3층', 5),
       ('IC-PBL Lab.3 ', '국제문학대학', '언론정보관', '3층', 5);

-- 팀플실 : 디자인대학
INSERT INTO study_room(name, university, building, location, capacity)
VALUES ('110호 영상디자인 1실', '디자인대학', '디자인연구관', '1층', 40),
       ('드로잉실', '디자인대학', '디자인연구관', '1층', 20),
       ('서피스인테리어 6실', '디자인대학', '디자인연구관', '2층', 40),
       ('세미나실', '디자인대학', '디자인연구관', '3층', 40),
       ('영상디자인스튜디오3실', '디자인대학', '디자인교육관', '1층', 40),
       ('영상디자인2실', '디자인대학', '디자인교육관', '1층', 40),
       ('영상디자인편집실', '디자인대학', '디자인교육관', '2층', 40),
       ('IT미디어랩', '디자인대학', '디자인교육관', '2층', 20),
       ('104호 IC-PBL 강의실2', '디자인대학', '디자인문화관', '2층', 40),
       ('106호 IC-PBL 강의실1', '디자인대학', '디자인문화관', '2층', 40),
       ('108호 패션디자인실', '디자인대학', '디자인문화관', '2층', 40);

-- 팀플실 : 예체능대학
INSERT INTO study_room(name, university, building, location, capacity)
VALUES ('101호 ICT실습준비실', '예체능대학', '체육관', '1층', 60),
       ('102호 시청각실', '예체능대학', '체육관', '1층', 60),
       ('105호 ICT실습준비실', '예체능대학', '체육관', '1층', 60),
       ('201호 강의실', '예체능대학', '체육관', '2층', 60),
       ('202호 강의실', '예체능대학', '체육관', '2층', 60),
       ('개인연습실 11', '예체능대학', '뮤즈홀', '2층', 4),
       ('개인연습실 12', '예체능대학', '뮤즈홀', '2층', 4),
       ('개인연습실 13', '예체능대학', '뮤즈홀', '2층', 4),
       ('개인연습실 14', '예체능대학', '뮤즈홀', '2층', 4),
       ('개인연습실 14', '예체능대학', '뮤즈홀', '2층', 4),
       ('소 연습실1', '예체능대학', '뮤즈홀', '3층', 10),
       ('소 연습실2', '예체능대학', '뮤즈홀', '3층', 10),
       ('녹음 컨트롤실', '예체능대학', '뮤즈홀', '3층', 5);


-- 스터디룸 태그
INSERT INTO study_room_descriptions(study_room_id, descriptions)
VALUES (1, '투명한 벽으로 구분된 팀플실'),
       (2, '투명한 벽으로 구분된 팀플실'),
       (3, '투명한 벽으로 구분된 팀플실'),
       (4, '투명한 벽으로 구분된 팀플실'),
       (5, '투명한 벽으로 구분된 팀플실'),
       (6, '칸막이로 구분된 팀플실'),
       (7, '칸막이로 구분된 팀플실'),
       (8, '칸막이로 구분된 팀플실'),
       (9, '투명한 벽으로 구분된 팀플실'),
       (10, '투명한 벽으로 구분된 팀플실');

INSERT INTO study_room_drinks(study_room_id, drinks)
VALUES (1, '커피'),
       (1, '물');

INSERT INTO study_room_cautions(study_room_id, cautions)
VALUES (1, '음식물 반입금지'),
       (1, '시끄럽게 떠드는 행위 금지');

INSERT INTO study_room_tags(study_room_id, tags)
VALUES (1, '태그1'),
       (1, '태그2');

-- 예약
INSERT INTO orders(study_room_id, user_id , start_time, end_time, date, state, booking_capacity)
VALUES (1, 1, 13.5, 14.5, '2023-03-23', 'RETURN', 4), -- 소프트웨어융합대학
       (1, 1, 14.5, 15.5, '2023-03-23', 'RETURN', 4),
       (1, 1, 15.5, 16.5, '2023-03-23', 'RETURN', 4),
       (1, 1, 16.5, 17.5, '2023-03-23', 'RETURN', 4),
       (1, 1, 17.5, 18.5, '2023-03-23', 'NORMAL', 4),
       (1, 1, 18.5, 19.5, '2023-03-23', 'NORMAL', 4),
       (1, 1, 19.5, 20.5, '2023-03-23', 'NORMAL', 4);
